OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.2599/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.589396176438862 0 -8.055494821346612)
	(21.88409426465829 0 -8.055494821346612)
	(21.88409426465829 9.174313546533641 -8.055494821346612)
	(-14.589396176438862 9.174313546533641 -8.055494821346612)
	(-14.589396176438862 0 3.8039836656359)
	(21.88409426465829 0 3.8039836656359)
	(21.88409426465829 9.174313546533641 3.8039836656359)
	(-14.589396176438862 9.174313546533641 3.8039836656359)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (163 41 53) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

