OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.2599/0.org/include/initialConditions
flowVelocity          (2.196164 0 0);
Umean                  2.196164;
turbulentKE            7.234703e-04;
turbulentOmega         1.508644e+00;
turbulentEpsilon       1.377393e-02;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;